<a href="https://colab.research.google.com/github/Garvish47/Cognitive_computing/blob/main/102317190_garvish_assignment3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd

dataset = {
    "Refund": ['yes', 'no', 'no', 'yes', 'no', 'no', 'yes', 'no', 'no', 'no'],
    "Marital Status": ['single', 'married', 'single', 'married', 'divorced', 'married', 'divorced', 'single', 'married', 'single'],
    "Taxable income": ['125k', '100k', '70k', '120k', '95k', '60k', '220k', '85k', '75k', '90k'],
    "Cheat": ['no', 'no', 'no', 'no', 'yes', 'no', 'no', 'yes', 'no', 'yes']
}

df = pd.DataFrame(dataset)
print(df)

  Refund Marital Status Taxable income Cheat
0    yes         single           125k    no
1     no        married           100k    no
2     no         single            70k    no
3    yes        married           120k    no
4     no       divorced            95k   yes
5     no        married            60k    no
6    yes       divorced           220k    no
7     no         single            85k   yes
8     no        married            75k    no
9     no         single            90k   yes

In [14]:
print(df.iloc[[0,4,7,8]])
print()

print(df.loc[3:7])
print()

print(df.iloc[4:9, 2:4])
print()

print(df.iloc[:, 1:4])

  Refund Marital Status Taxable income Cheat
0    yes         single           125k    no
4     no       divorced            95k   yes
7     no         single            85k   yes
8     no        married            75k    no

  Refund Marital Status Taxable income Cheat
3    yes        married           120k    no
4     no       divorced            95k   yes
5     no        married            60k    no
6    yes       divorced           220k    no
7     no         single            85k   yes

  Taxable income Cheat
4            95k   yes
5            60k    no
6           220k    no
7            85k   yes
8            75k    no

  Marital Status Taxable income Cheat
0         single           125k    no
1        married           100k    no
2         single            70k    no
3        married           120k    no
4       divorced            95k   yes
5        married            60k    no
6       divorced           220k    no
7         single            85k   yes
8        married            75k    no
9         single            90k   yes

In [16]:
df = pd.read_csv("Iris.csv")
#uploaded iris.csv directly on the runtime with the files option on colab
#df_csv = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
# Display the first 5 rows

print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [17]:
df = df.drop(index=3)

df = df.drop(df.iloc[:, 2].name, axis = 1)

print(df.head())

   Id  SepalLengthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1            1.4           0.2  Iris-setosa
1   2            4.9            1.4           0.2  Iris-setosa
2   3            4.7            1.3           0.2  Iris-setosa
4   5            5.0            1.4           0.2  Iris-setosa
5   6            5.4            1.7           0.4  Iris-setosa

In [9]:
dataset = {
    "Employee_ID": [101,102,103,104,105],
    "Name": ['Alice', 'Bob', 'Charlie', 'Diana', 'Edward'],
    "Department": ['HR', 'IT', 'IT', 'Marketing', 'Sales'],
    "Age": [29, 34, 41, 28, 38],
    "Salary": [5000, 7000, 6500, 5500, 6000],
    "Years_of_experience": [4, 8, 10, 3, 12],
    "Joining_date": ['2020-03-15', '2017-07-19', '2013-06-01', '2021-02-10', '2010-11-25'],
    "Gender": ['Female', 'Male', 'Male', 'Female', 'Male'],
    "Bonus": [5000, 7000, 6000, 4500, 5000],
    "Rating": [4.5, 4.0, 3.8, 4.7, 3.5]
}

df = pd.DataFrame(dataset)
df.to_csv("employee_data.csv", index=False)

df = pd.DataFrame(dataset)

df.to_csv("employees.csv", index=False)

df = pd.read_csv("employees.csv")

shape = df.shape

summary = df.info()

descriptive_stats = df.describe()

first_5_rows = df.head()
last_3_rows = df.tail(3)

average_salary = df["Salary"].mean()
total_bonus = df["Bonus"].sum()
youngest_age = df["Age"].min()
highest_rating = df["Rating"].max()

sorted_by_salary = df.sort_values(by="Salary", ascending=False)

def categorize_performance(rating):
    if rating >= 4.5:
        return "Excellent"
    elif 4.0 <= rating < 4.5:
        return "Good"
    else:
        return "Average"

df["Performance_Category"] = df["Rating"].apply(categorize_performance)

missing_values = df.isnull().sum()

df.rename(columns={"Employee_ID": "ID"}, inplace=True)

df["Tax"] = df["Salary"] * 0.1

df.to_csv("modified_employees.csv", index=False)

(
    shape,
    descriptive_stats,
    first_5_rows,
    last_3_rows,
    average_salary,
    total_bonus,
    youngest_age,
    highest_rating,
    sorted_by_salary,
    df,
    missing_values,
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_experience  5 non-null      int64
 6   Joining_date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes

((5, 10),
        Employee_ID        Age       Salary  Years_of_experience   Bonus  \
 count     5.000000   5.000000     5.000000             5.000000     5.0
 mean    103.000000  34.000000  6000.000000             7.400000  5500.0
 std       1.581139   5.612486   790.569415             3.847077  1000.0
 min     101.000000  28.000000  5000.000000             3.000000  4500.0
 25%     102.000000  29.000000  5500.000000             4.000000  5000.0
 50%     103.000000  34.000000  6000.000000             8.000000  5000.0
 75%     104.000000  38.000000  6500.000000            10.000000  6000.0
 max     105.000000  41.000000  7000.000000            12.000000  7000.0

          Rating
 count  5.000000
 mean   4.100000
 std    0.494975
 min    3.500000
 25%    3.800000
 50%    4.000000
 75%    4.500000
 max    4.700000  ,
    Employee_ID     Name Department  Age  Salary  Years_of_experience  \
 0          101    Alice         HR   29    5000                    4
 1          102      Bob         IT   34    7000                    8
 2          103  Charlie         IT   41    6500                   10
 3          104    Diana  Marketing   28    5500                    3
 4          105   Edward      Sales   38    6000                   12

   Joining_date  Gender  Bonus  Rating
 0   2020-03-15  Female   5000     4.5
 1   2017-07-19    Male   7000     4.0
 2   2013-06-01    Male   6000     3.8
 3   2021-02-10  Female   4500     4.7
 4   2010-11-25    Male   5000     3.5  ,
    Employee_ID     Name Department  Age  Salary  Years_of_experience  \
 2          103  Charlie         IT   41    6500                   10
 3          104    Diana  Marketing   28    5500                    3
 4          105   Edward      Sales   38    6000                   12

   Joining_date  Gender  Bonus  Rating
 2   2013-06-01    Male   6000     3.8
 3   2021-02-10  Female   4500     4.7
 4   2010-11-25    Male   5000     3.5  ,
 6000.0,
 27500,
 28,
 4.7,
    Employee_ID     Name Department  Age  Salary  Years_of_experience  \
 1          102      Bob         IT   34    7000                    8
 2          103  Charlie         IT   41    6500                   10
 4          105   Edward      Sales   38    6000                   12
 3          104    Diana  Marketing   28    5500                    3
 0          101    Alice         HR   29    5000                    4

   Joining_date  Gender  Bonus  Rating
 1   2017-07-19    Male   7000     4.0
 2   2013-06-01    Male   6000     3.8
 4   2010-11-25    Male   5000     3.5
 3   2021-02-10  Female   4500     4.7
 0   2020-03-15  Female   5000     4.5  ,
     ID     Name Department  Age  Salary  Years_of_experience Joining_date  \
 0  101    Alice         HR   29    5000                    4   2020-03-15
 1  102      Bob         IT   34    7000                    8   2017-07-19
 2  103  Charlie         IT   41    6500                   10   2013-06-01
 3  104    Diana  Marketing   28    5500                    3   2021-02-10
 4  105   Edward      Sales   38    6000                   12   2010-11-25

    Gender  Bonus  Rating Performance_Category    Tax
 0  Female   5000     4.5            Excellent  500.0
 1    Male   7000     4.0                 Good  700.0
 2    Male   6000     3.8              Average  650.0
 3  Female   4500     4.7            Excellent  550.0
 4    Male   5000     3.5              Average  600.0  ,
 Employee_ID             0
 Name                    0
 Department              0
 Age                     0
 Salary                  0
 Years_of_experience     0
 Joining_date            0
 Gender                  0
 Bonus                   0
 Rating                  0
 Performance_Category    0
 dtype: int64)